# RbsFamilyContentSecondaryDistribsys Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFamilyContentSecondaryDistribsys Property
ParameterTypeId Class See Also
---
"Secondary Distribution System"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFamilyContentSecondaryDistribsys { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFamilyContentSecondaryDistribsys As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFamilyContentSecondaryDistribsys {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace